Repository: markus-senger/HMI_for_a_CNC_machine
Catalog: Logical/LocalizableTexts.tmx
Source language: en
Languages: de, fr

source: Reset error
de: Fehler rücksetzen
fr: Réinitialiser l'erreur

source: On / Off
de: Ein / Aus
fr: marche / arrêt

source: Error codes
de: Fehlercodes
fr: Codes d'erreur

source: 3-axis machining center
de: 3-Achs Bearbeitungszentrum
fr: Centre d'usinage 3 axes

source: Documentation
de: Dokumentation

source: Program editor
de: Programmeditor
fr: Éditeur de programmes

source: Alarm handling
de: Alarmbehandlung
fr: Gestion des alarmes

source: Analysis
de: Analyse
fr: Une analyse

source: Control
de: Steuerung
fr: Commande

source: Specification
de: Angabe
fr: Indication

source: Elaboration
de: Ausarbeitung
fr: Élaboration

source: Record
de: Aufzeichnung
fr: Enregistrement

source: Start / Stop Record
de: Start / Stop Aufzeichnung
fr: Début / Fin de l'enregistrement

source: Recording in progress
de: Aufzeichnung läuft
fr: Enregistrement en cours

source: Recording not running
de: Aufzeichnung läuft nicht
fr: L'enregistrement ne fonctionne pas

source: Restart
de: Neustart
fr: Redémarrer

source: Continue
de: Fortsetzen
fr: Continuez

source: Break
de: Pause
fr: Pause

source: Open File
de: Datei öffnen
fr: Fichier ouvert

source: Save as
de: Speichern unter
fr: Enregistrer sous

source: Run
de: Ausführen
fr: Exécuter

source: End stop reached
de: Endanschlag erreicht
fr: Fin de course atteinte

source: Input fields
de: Eingabefelder
fr: Champs de saisie

source: disabled
de: deaktiviert
fr: désactivé

source: enable control
de: Steuerung aktivieren
fr: activer le contrôle

source: Sensitivity
de: Empfindlichkeit
fr: Sensibilité

source: Input X:
de: Eingabe X:
fr: Entrée X:

source: Input Y:
de: Eingabe Y:
fr: Entrée Y:

source: Input Z:
de: Eingabe Z:
fr: Entrée Z:

source: stop chart
de: Diagramm stoppen
fr: diagramme d'arrêt

source: start chart
de: Diagramm starten
fr: Tableau de départ

source: path velocity
de: Bahngeschwindigkeit
fr: vitesse de trajectoire

source: About
de: Über
fr: À propos

source: Logged in as
de: Eingeloggt als
fr: Connecté en tant que

source: User list
de: Benutzerliste
fr: Liste des utilisateurs

source: Login
de: Einloggen
fr: Se connecter

source: Logout
de: Ausloggen
fr: Se déconnecter

source: Role
de: Rolle
fr: Rôle

source: Last Login
de: Letzte Anmeldung
fr: Dernière connexion

source: Acknowledge
de: Bestätigen
fr: Accuser réception

source: Set software limit
de: Softwareendschalter einstellen
fr: Régler les fins de course du logiciel

source: Caution depending on the driving speed, the machine can drive a little further than the software limit switches.
de: Achtung je nach Fahrgeschwindigkeit kann die Maschine etwas weiter als die Softwareendschalter fahren.
fr: Attention selon la vitesse d'avancement, la machine peut aller un peu plus loin que les fins de course logicielles.

source: Home
fr: Accueil

source: Joystick
fr: Manette

source: Name
fr: Nom
